Ac6Embedded/svd-microchip/PIC32CK_GC/PIC32CK1012GC00048.svd
            <register>
               <name>PATTBUF</name>
               <description>Pattern Buffer</description>
               <addressOffset>0x64</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PGEB0</name>
                     <description>Pattern Generation 0 Output Enable Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB1</name>
                     <description>Pattern Generation 1 Output Enable Buffer</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB2</name>
                     <description>Pattern Generation 2 Output Enable Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB3</name>
                     <description>Pattern Generation 3 Output Enable Buffer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB4</name>
                     <description>Pattern Generation 4 Output Enable Buffer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB5</name>
                     <description>Pattern Generation 5 Output Enable Buffer</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB6</name>
                     <description>Pattern Generation 6 Output Enable Buffer</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGEB7</name>
                     <description>Pattern Generation 7 Output Enable Buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB0</name>
                     <description>Pattern Generation 0 Output Value Buffer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB1</name>
                     <description>Pattern Generation 1 Output Value Buffer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB2</name>
                     <description>Pattern Generation 2 Output Value Buffer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB3</name>
                     <description>Pattern Generation 3 Output Value Buffer</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB4</name>
                     <description>Pattern Generation 4 Output Value Buffer</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB5</name>
                     <description>Pattern Generation 5 Output Value Buffer</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB6</name>
                     <description>Pattern Generation 6 Output Value Buffer</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGVB7</name>
                     <description>Pattern Generation 7 Output Value Buffer</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF</name>
               <description>Period Buffer</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH4_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH5_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERBUF_DITH6_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERBUF</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PERBUF</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF[%s]</name>
               <description>Compare and Capture Buffer</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH4_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCBUF[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERBUF</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>26</bitWidth>
                  </field>
               </fields>
            </register>
